export enum TEAMIDS {
    FIRST = 0,
    SECOND = 1,
}

export interface IQuestion {
    name: string;
    proffession: string;
    city: string;
    question: string;
    details?: string;
    link?: string;
    answer: string;
    isBlitz?: boolean;
    teamID?: TEAMIDS;
    level: number;
}

export interface ITeam {
    teamID: TEAMIDS;
    players: IPlayer[];
    teamLead: string;
}

export interface IPlayer {
    name: string;
    title: string;
    proffession: string;
    isTeamLead?: boolean;
}

export const TEAMS: ITeam[] = [
    {
        teamID: TEAMIDS.FIRST,
        teamLead: 'Վարսիկ Քարամյան',
        players: [
            { 
                name: 'Շուշանիկ Հարությունյան', 
                proffession: 'ՈԱ առաջատար',
                title: 'տիկին'
            },
            { 
                name: 'Սմբատ Հայրյան', 
                proffession: 'ՈԱ վերլուծաբան',
                title: 'պարոն'
            },
            { 
                name: 'Հայկ Երիցյան', 
                proffession: 'ՈԱ վերլուծաբան',
                title: 'պարոն'
            },
            {
                name: 'Մանե Հայրապետյան',
                proffession: 'ՈԱ ինժիներ',
                title: 'օրիորդ'
            },
            {
                name: 'Սոֆի Գրիգորյան',
                proffession: 'ՈԱ փորձարկող',
                title: 'օրիորդ'
            },
            {
                name: 'Վարսիկ Քարամյան',
                proffession: 'Որակի ապահովման վերլուծաբան',
                title: 'տիկին',
                isTeamLead: true,
            },
        ]
    },
    {
        teamID: TEAMIDS.SECOND,
        teamLead: 'Հայկ Աբրահամյան',
        players: [
            {
                name: 'Արամ Մաշուրյան',
                proffession: 'գեղանկարիչ',
                title: 'պարոն',
            },
            {
                name: 'Տիգրան Պողոսյան',
                proffession: 'ինժեներ',
                title: 'պարոն',
            },
            {
                name: 'Գարեգին Ղազարյան',
                proffession: 'Պատմաբան',
                title: 'պարոն',
            },
            {
                name: 'Արուս Աղաբեկյան',
                proffession: 'ՏՏ մասնագետ',
                title: 'տիկին',
            },
            {
                name: 'Հակոբ Բաբախանյան',
                proffession: 'Ինժեներ-տեխնոլոգ',
                title: 'պարոն',
            },
            {
                name: 'Հայկ Աբրահամյան',
                proffession: 'գործարար',
                title: 'պարոն',
                isTeamLead: true,
            },

        ]
    }
];

export const QUESTIONS: IQuestion[] = [
    {
        name: 'Արտուր Խոջաբաղյան',
        proffession: 'Ծրագրավորող',
        city: 'Գորիս',
        question: `
            Վերջերս մայթում կանգնած էի, երբ Գորիսում հայտնի ծերունիներից մեկը իջնում էր։ Բարեւեցի, նա էլ բարեւեց ու հանգավորված մի բան արտասանեց։
            ֊ Հետաքրքիր էր,֊ ծիծաղեցի ես,֊ դո՞ւք եք հորինել։
            Պատասխանի փոխարեն նա ասաց․
            ֊ Երբ գալիս է X֊ը, ես դառնում եմ Y, իսկ գիշերը լուսան։
            Հարգելի գիտակներ, խնդրում եմ պատասխանեք թե որն է X֊ը եւ Y֊ը։
        `,
        answer: 'Պատասխան՝ Երբ գալիս է մուսան, ես դառնում են գուսան, իսկ գիշերը լուսան։',
        teamID: TEAMIDS.FIRST,
        level: 9,
    },
    {
        name: 'Սոֆի Միրզոյան',
        proffession: 'Բժիշկ',
        city: 'Երևան',
        question: `
            Վերջերս կանադական հայտնի գովազդային ընկերություններից մեկը (MacLaren McCann ընկերությունը) թողարկել է գովազդային կոնցեպտուալ պրինտների մի շարք,որոնցից մեկը ներկայացնում ենք Ձեր ուշադրությանը:Հարգելի գիտակներ,ուշադիր նայեք նկարի դետալներին և փորձեք տրամաբանության միջոցով պատասխանել,թե ինչ նպատակով են օգտագործվում տվյալ գովազդային նկարները:
        `,
        link: 'https://drive.google.com/file/d/1FBb6iRiAge_PUNmulpioDav6esMa8gxN/view?usp=sharing',
        answer: 'Ինչպես տեսնում ենք նկարում պատկերված է դաջվածք (տատու) Ուսամա Բեն Լադենի դիմանկարով,ում ճակատին ուղղված է լազերային ճառագայթը:Գովազդի պատվիրատու ընկերությունը այս կերպ փորձել է գովազդել իր նոր` լազերային ճառագայթման միջոցով դաջվածքների վերացման ծառայությունը` այդպիսով կոտրելով դաջվածքի (և ինչու չէ նաև Ուսամա Բեն Լադենի) հավերժական և անջնելի լինելու փաստը:',
        teamID: TEAMIDS.SECOND,
        level: 8,
    },
    {
        name: 'Արման Խաչատրյան',
        proffession: 'Ուսանող',
        city: 'Քաջարան',
        question: `
            Քո սերը դեպի լույսը ոչնչացնում է իմ ընտանիքը.
            Հին արևելյան առակի հերոսուհին այսպես է դիմում մյուս հերոսուհուն։
            Նրանցից մեկին կարելի է հանդիպել նաեւ Մեծ Լոռեցու մոտ
            Անվանեք այդ երկու հերոսուհիներին եւ բացատրեք, թե ինչու է մեկի սերը ոչնչացնում մյուսի ընտանիքը?
        `,
        answer: 'Մեղու և Թիթեռ: Թիթեռները շատ են սիրում թռնել մոմի լույսի ներքո.Հնում մոմը պատրաստված է եղել մեղրամոմից հետևաբար մոմ պատրաստելու համար ոչնչանում էին մեղվի ընտանիքը:',
        teamID: TEAMIDS.SECOND,
        level: 8,
    },
    {
        name: 'Նոննա Ալումյան',
        proffession: 'Թեստավորող',
        city: 'Գորիս',
        question: `
            Նկարում պատկերված է Հիտլերի աջ ձեռք Յոզեֆ Գեբելսը։
            Առաջին նկարում նա չգիտեր դրա մասին, իսկ երկրորդում՝ արդեն տեղեկացրել էին։ 
            Հարգելի գիտակներ ասացեք ի՞նչ էին տեղեկացրել Գեբելսին, որ նրա դեմքը այդպես փոխվեց։
        `,
        link: 'http://polzam.ru/index.php/istorii/item/732-korol-fotografii-alfred-ejzenshtadt',
        answer: 'Առաջին նկարում Գեբելսը դեռ չգիտեր, որ լուսանկարիչը հրեա է, իսկ երկրորդում նա արդեն տեղեկացված էր։',
        teamID: TEAMIDS.SECOND,
        level: 8,
    },
    {
        name: 'Անահիտ Մկրտչյան',
        proffession: 'Անհատ ձեռնարկատեր',
        city: 'Գորիս',
        question: `
            1915 թ.-ին անգլիացի օդաչուն թռչելով Լիլի օդանավակայանի վրայով նետում է ֆուտբոլային գնդակ: Բոլորը փախչում են կարծելով, թե ռումբ է:
            Սակայն գնդակի վրա գրություն էլ կա, որով անգլիացի օդաչուն շնորհավորում էր նրանց:
            Հարգելի գիտակներ, իսկ ի՞նչն էր շնորհավորում անգլիացի օդաչուն:
        `,
        answer: `Գնդակի վրա գրված էր. <ՇՆորհավոր ապրիլի 1>`,
        teamID: TEAMIDS.SECOND,
        level: 8,
    },
    {
        name: 'Անահիտ Մկրտչյան',
        proffession: 'Անհատ ձեռնարկատեր',
        city: 'Գորիս',
        question: `
            Եթե իմ X-ը հաստատվի, ապա գերմանացիները կասեն, որ ես գերմանացի եմ, ֆրանսիացիները՝ որ ես աշխարհի քաղաքացի եմ, սակայն եթե այն հերքվի, ապա ֆրանսիացիները ինձ կհռչակեն գերմանացի , իսկ գերմանացիները՝ հրեա:
            Հարգելի գիտակներ փորձեք ասել, թե ո՞վ է այս խոսքերի հեղինակը և ի՞նչ է  X-ը:
        `,
        answer: `Այս խոսքերի հեղինակը Ալբերտ Էյնշտեյնն է և խոսքը նրա հարաբերականության տեսության մասին է:        `,
        teamID: TEAMIDS.FIRST,
        level: 8,
    },
    {
        name: 'Հայկանուշ Վանդունց',
        proffession: 'Թոշակառու',
        city: 'Գորիս',
        question: `
            Նկար-հարց:
Հարգելի գիտակներ, կա մի քաղաք, որտեղ այսպիսի ստվերներ շատ կան: Փորձեք հասկանալ թե ինչպե՞ս են դրանք առաջացել և ո՞ր քաղաքում են դրանք գտնվում:

        `,
        link: 'https://i.pinimg.com/originals/6e/01/01/6e0101903b530df5b365bde93c3d5be7.jpg',
        answer: `Այս ստվերները առաջացել են միջուկային պայթյունի ընթացքում լույսի ճառագայթահարման արդյունքում այն վայրերում, որտեղ մարդու մարմինը կանխել է ճառագայթման տարածումը:Դրանք գտնվում են Հերոսիմա քաղաքում:`,
        teamID: TEAMIDS.FIRST,
        level: 7,
    },
    {
        name: 'Գոռ Արզանյան',
        proffession: 'Աշակերտ',
        city: 'Գորիս',
        question: `
            Երբ հանրաճանաչ գրող Մարկ Տվենը թերթի խմբագիր էր, փոստը մի անգամ մի ընթերցողից նամակ բերեց: Նամակին կցված էր սոսկալի անգրագետ մի բանաստեղծություն, որը վերնագրված էր "Ես ինչո՞ւ եմ ողջ":
Մարկ Տվենը թերթում տպագրեց հետևյալ պատասխանը հեղինակին.
"Որովհետև Դուք այդ բանսատեղծությունը..."
Հարգելի գիտակներ, ավարտեք գրողի խոսքը։
        `,
        answer: `"Որովհետև դուք այդ բանսատեղծությունը անձամբ չբերեցիք խմբագրություն":`,
        teamID: TEAMIDS.SECOND,
        level: 6,
    },
    {
        name: 'Սամվել  Կոստանդյան',
        proffession: 'Մանկավարժ',
        city: 'Գորիս',
        question: `
            1809թ. ֆրանսիացի մի գյուտարար անձամբ Նապոլեոնի ձեռքից ստացավ 12000 ֆրանկ մի գյուտի համար,որը նա ստեղծել էր դրանից ութ ամիս առաջ:Ինչ գյուտի մասին է խոսքը,եթե այդ ուշացումը ոչ մի մարդուց կախված չէր,այլ ուներ զուտ օբյեկտիվ պատճառ:
        `,
        answer: `Խոսքը մթերքների պահածոյացման գյուտի մասին է,իսկ ուշացումը պայմանավորված էր պահածոյացված մթերքի պիտանելիությունը հաստատելու համար:`,
        teamID: TEAMIDS.SECOND,
        level: 7,
    },
    {
        name: 'Սամվել Մարգարյան',
        proffession: 'Աշակերտ',
        city: 'Գորիս',
        question: `
            Սա  քանդակագործ Իսաակ Կորդալի քանդակն է Բեռլինում:
Հարգելի գիտակներ, նայելով նկարին փորձեք ասել թե ի՞նչ է այս քանդակի  անվանումը կամ ի՞նչ ենթատեքստ ունի այն:
        `,
        link: 'https://i.pinimg.com/originals/cc/d3/5a/ccd35aee9e6d43d8d2132e16d1b6bd80.jpg',
        answer: `Քանդակի անվանումն է <Քաղաքական գործիչները քննարկում են գլոբալ տաքացումը>:`,
        teamID: TEAMIDS.FIRST,
        level: 7,
    },
    {
        name: 'Էդգար Մարտիրոսյան',
        proffession: 'մարքեթոլոգ/հանրային ծառայող',
        city: 'Կապան',
        question: `Վիդեոհարց`,
        link: 'https://drive.google.com/open?id=1E7QK-V1lbfmIcaaKR3V8I8hIaGeQTocn',
        answer: `Քանի որ Չինաստանում ուտելիս օգտագործում են փայտիկներ, փոքր չափսի ափսեն հարմար է մոտեցնել բերանին և խմել ապուրի հյութը`,
        teamID: TEAMIDS.FIRST,
        level: 5,
    },
    {
        name: 'Նաիրի Պողոսյան',
        proffession: 'Աշակերտ',
        city: 'Գորիս',
        question: `Նկարում պատկերված են 20-րդ դարի նշանավոր երեք առաջնորդները՝ Իոսիֆ Ստալինը, Ուինսթոն Չերչիլը և Ադոլֆ Հիտլերը: Նրանցից յուրաքանչյուրը <<թաքցնում >> է մեկ բառ, որոնք ճիշտ հերթականությամբ դասավորելիս կստանանք բոլորիս հայտնի մի արտահայտություն; Փորձեք ասել, թե ինչի մասին է խոսքը:`,
        link: 'https://scontent.fevn2-1.fna.fbcdn.net/v/t1.15752-9/59286041_319298278763569_6919350248393408512_n.jpg?_nc_cat=106&_nc_ohc=gLjC2_xQm14AQljyiBseUydMsHvOrs26lqEtgyhhxUuWBj2s6Stydthww&_nc_ht=scontent.fevn2-1.fna&oh=7979b23e905649466054542c25adb14b&oe=5E72B1BC',
        answer: `Ստալինը թաքցնում է քար նառը, Չերչիլը՝ մկրատ, իսկ Հիտլերը՝ թուղթ:Այս հերթականությամբ դասավորելով մենք ստանում քար, թուղթ, մկրատ արտահայտոըթյունը, որը բոլորիս հայտնի ՉԻՆԳԱՉՈՒՆԳ խաղի հիմքն է:`,
        teamID: TEAMIDS.FIRST,
        level: 3,
    },
    {
        name: 'Լիանա Պողոսյան',
        proffession: 'Ուսուցչուհի',
        city: 'Գորիս',
        question: `Սկսել հենց հիմա, առանց հատուկ ջանքերի, մանր քայլերով, հետևել ժամին՝ համոզվելու համար, որ այն իրականում երկար չի տևում, ցուցաբերել գեղարվեստական մոտեցում, ժպտալ և պարծենալ, կատարել ամենը թեթևությամբ՝ կարծես թռչելով: Ե՞րբ կարող է այս՝ «Ճախրող կին» կոչվող մեթոդն օգտակար լինել:`,
        answer: `Որպես չափազանց օգտակար «Ճախրող կին» մեթոդը խորհուրդ է տրվում բնակարանի մաքրման ժամանակ:`,
        teamID: TEAMIDS.FIRST,
        level: 4,
    },
    {
        name: 'Նարեկ Արզումանյան',
        proffession: 'Ծրագրավորող',
        city: 'Երեւան',
        question: `1999թ. Դյուսելդորֆի օդանավակայանից ինքնաթիռ է թռել դեպի Դյուսելդորֆ։ Տոմսը 600€... 

Չէ, ես ոչ մի բան չեմ շփոթել։ Եթե դուք լինեիք այդ ուղևորներից մեկը, ապա անպայման կցանկանայիք, որ ձեր նստատեղը լիներ պատուհանի մոտ։

Իսկ այժմ հարցը. Ինչու՞ էին մարդիկ Դյուսելդորֆ ից թռչում Դյուսելդորֆ ???
`,
        answer: `Արեւի խավարումը տեսնելու համար`,
        teamID: TEAMIDS.FIRST,
        level: 9,
    },
    {
        name: 'Սաշա Ծատրյան',
        proffession: 'Ուսանող',
        city: 'Երեւան',
        question: `Գորիսեցիների համար ձմռան յուրաքանչյուր օր կարող է լինել Վերջին Դատաստանի օր, իսկ ըստ Ղուրանի վերջին Դատաստանը  լինում է  միայն մահից հետո։ Հարց անվանեք թե կոնկրետ որ բառն է Ղուրանում նշանակում դատաստանի օր`,
        answer: `Քայամաթ, Խըյամաթ`,
        teamID: TEAMIDS.FIRST,
        level: 9,
    },
    {
        name: 'Սաշա Ծատրյան',
        proffession: 'Ուսանող',
        city: 'Երեւան',
        question: `Պարագվայի դրոշը տարբերվում է  մնացած երկրների դրոշից մի յուրահատկությամբ։ Եթե ձեռքի տակ ունենայիք դրոշը, ապա այդ յուրահատկությունն առավել քան ակնհայտ կլիներ; Հարց անվանեք այդ յուրահատկությունը եթե այդ հատկությունը ունի նաև  օրինակ Պարագվայական  1  գուարանի մետաղադրամը։`,
        answer: `Պարագվայի դրոշն ունի երկու դարձերես`,
        teamID: TEAMIDS.SECOND,
        level: 7,
    },
    {
        name: 'Կորյուն Արզումանյան',
        proffession: 'Ռեժիսոր',
        city: 'Երեւան',
        question: `Հումորային հարց. Վերջերս սրամիտ հումորիստը առաջարկում էր այդ 2 օբյեկտներն անվանել <ժաննա> և <ջորդանո>. Ինչ օբյեկտների մասին է խոսքը`,
        answer: `Դիակիզարան`,
        teamID: TEAMIDS.SECOND,
        level: 6,
    },
    {
        name: 'Նաիրի Նարինյան',
        proffession: 'Ծրագրավորող',
        city: 'Երեւան',
        question: `1946թ. մայիսյան մի օր Լոս Ալամոսում աշխատանքի ընթացքում Լուիզ Սլոտինը պատահաբար ձեռքից գցում է պտուտակահանը։
            Գործիքի ընկնելու պահին Սլոտինը նկատում է ակնթարթային կապույտ լույս։ Դեպքից ընդամենը 9 օր անց Սլոտինը մահանում է։ Հարց. ի՞նչ էր պատահել, եթե նմանատիպ դեպք նախկինում տեղի էր ունեցել միայն մեկ անգամ՝ այն էլ ազգությամբ հայի հետ։
        `,
        details: 'Նախկինում նման դեպք պատահել էր միջուկային ինժեներ Հարի Դաղլյանի հետ',
        answer: `Սլոտինի պտուտակահանը պատահաբար ընկել էր միջուկային գերակտիվ նյութի մեջ, որն էլ առաջացրել էր ուժեղ ռեակցիա`,
        teamID: TEAMIDS.FIRST,
        level: 9,
    },
    {
        name: 'Սմբատ Հայրյան',
        proffession: 'ՏՏ Մասնագետ',
        city: 'Գորիս',
        question: `

        `,
        answer: ``,
        teamID: TEAMIDS.SECOND,
        level: 8,
    },
    {
        name: 'Հարություն Համբարչյան',
        proffession: 'Քանդակագործ',
        city: 'Գորիս',
        question: `
            Մի առիթով քննադատների խումբը այցելում է վերածննդի հայտնի քանդակագործներից մեկի՝ Միքելանջելոյի արվեստանոց։Ի տարբերություն Լեոնարդոյի խոհեմությանը,քննադատներից մեկը, քանդակագործին ասում է,թե քանդակի քիթը ծուռ է արված,գործը որակելով՝ չստացված։ Իր գործը լավագույնս իմացող վարպետը,ով արդեն տարածված համբավ ուներ ամբողջ Իտալիայում,բարձրանում է դազգահի վրա շտկելու նշված սխալը,մուրճի մի քանի հարված լսելուց և թափվող փոշին տեսնելուց հետո,կեղծ էլիտարստական հայացքների տեր քննադատը ,իր բացականչություններով հասկացնում է,որ արդեն ուղղվել է քիթը։
            Ինչ արեց Միքելանջելոն,որը բավարարեց և իրեն,և քննադատին։
        `,
        answer: `«ոչինչ չարեց» պրցրնալիս դազգահը փոծին երակլալ ծերը սոտ թխալ երածալ,քշացալ`,
        teamID: TEAMIDS.FIRST,
        level: 8,
    },
    {
        name: 'Նելլի Պողոսյան',
        proffession: 'Երաժիշտ',
        city: 'Գորիս',
        question: `
            Անգլերեն SURVIVAL նշանակում է փրկություն, գոյատեւում։
            Վերջերս ամերիկյան մի զինվորական այդ բառի առաջին տառերով կազմել էր 8 այն ամենաանհրաժեշտ ունակությունների
            ցանկը, որը պետք է ունենա յուրաքանչյուր զինվորական։ Ըստ նրա, ամենակարեւորը I տառով (բառասկզբում կարդացվում է Ի)
            սկսողն էր։
            Եվ այսպես, ես կթվարկեմ մյուս 7ը, իսկ I տառով սկսվող ինտերնացիոնալ բառը պետք է գուշակեք ինքներդ։
            ԳՆԱՀԱՏԵԼ ԻՐԱՎԻՃԱԿԸ, ՕԳՏԱԳՈՐԾԵԼ ԲՈԼՈՐ ԶԳԱՅԱՐԱՆՆԵՐԸ, ՀԻՇԵԼ, ԹԵ ՈՐՏԵՂ ԵՍ, ՃՆՇԵԼ ՎԱԽԸ, ԳՆԱՀԱՏԻՐ ԿՅԱՆՔԸ, ԳՈՐԾԻՐ ՏԵՂԱՑԻՆԵՐԻ ՊԵՍ, ԱՊՐԻՐ ՔՈ ԽԵԼՔՈՎ։ 
        `,
        answer: `Ըստ այդ զինվորականի բոլոր զինվորականները ամենից բացի, պետք է կարողանան իմպրովիզ անել, քանի որ հենց դա կարող է միշտ փրկության գործիք հանդիսանալ ամենադժվար իրադրություններում:`,
        teamID: TEAMIDS.SECOND,
        level: 8,
    },
    {
        name: 'Լիանա Գրիգորյան',
        proffession: 'Ուսուցչուհի',
        city: 'Գորիս',
        question: `
            Բելառուս հաղորդավարուհի Էլեանորա Եզերսկայան  պատմում է, որ մեկ անգամ գալով տուն դպրոցից իր մայրիկին ասում է որ իրենց դասարան նոր աշակերտուհի է եկել, ում ազգանունը 《СССР》 է ։ Մայրը սկսեց կասկածել , թե դուստրը սկսել է ստել ։ Եվ այդ պատճառով էլ հաջորդ օրը գնաց դպրոց։ Դպրոց գնալուց և նոր աշակերտուհու իսկական ազգանունը իմանալուց հետո մայրը պարզապես սկսել էր ծիծաղել դստեր տրամաբանության վրա։
            Ինչ էր նոր աշակերտուհու իսկական ազգանունը։
        `,
        answer: `Այդ աղջկա ազգանունը Ռոդինա էր։`,
        teamID: TEAMIDS.SECOND,
        level: 9,
    },
]
